---
kind: method
id: M:Autodesk.Revit.DB.CitySet.ReverseIterator
source: html/88896eaa-61b8-bc3e-b6a7-857cea72ad69.htm
---
# Autodesk.Revit.DB.CitySet.ReverseIterator Method

Retrieve a backward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual CitySetIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the set.